benchmarks/results/auth-serialization/test-signin/baseline/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 839.372ms, rate sampling interval: 2193ms
  Thread calibration: mean lat.: 832.460ms, rate sampling interval: 2179ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   860.87ms  229.67ms   1.12s    51.67%
    Req/Sec     0.94      0.23     1.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05s 
 75.000%    1.09s 
 90.000%    1.09s 
 99.000%    1.10s 
 99.900%    1.12s 
 99.990%    1.12s 
 99.999%    1.12s 
100.000%    1.12s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     601.087     0.000000            1         1.00
     613.375     0.100000            7         1.11
     620.543     0.200000           12         1.25
     628.223     0.300000           18         1.43
     634.367     0.400000           25         1.67
    1045.503     0.500000           30         2.00
    1061.887     0.550000           33         2.22
    1073.151     0.600000           36         2.50
    1077.247     0.650000           39         2.86
    1083.391     0.700000           42         3.33
    1086.463     0.750000           45         4.00
    1088.511     0.775000           47         4.44
    1089.535     0.800000           50         5.00
    1089.535     0.825000           50         5.71
    1090.559     0.850000           52         6.67
    1091.583     0.875000           53         8.00
    1092.607     0.887500           54         8.89
    1092.607     0.900000           54        10.00
    1096.703     0.912500           57        11.43
    1096.703     0.925000           57        13.33
    1096.703     0.937500           57        16.00
    1096.703     0.943750           57        17.78
    1096.703     0.950000           57        20.00
    1098.751     0.956250           58        22.86
    1098.751     0.962500           58        26.67
    1100.799     0.968750           59        32.00
    1100.799     0.971875           59        35.56
    1100.799     0.975000           59        40.00
    1100.799     0.978125           59        45.71
    1100.799     0.981250           59        53.33
    1116.159     0.984375           60        64.00
    1116.159     1.000000           60          inf
#[Mean    =      860.868, StdDeviation   =      229.670]
#[Max     =     1115.136, Total count    =           60]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90 requests in 30.02s, 120.41KB read
Requests/sec:      3.00
Transfer/sec:      4.01KB